
@extends('global.body')

@section('banner')
    @include('components.banner', ['titleEn' => 'Contact Us', 'title' => '聯絡我們'])
@stop

@section('content')
    <section class="l-section l-section--info mt-6">
        <div class="container">
            <header class="c-feature-title">
                <div class="c-feature-title__top">
                    Contact Info
                </div>

                <h3 class="c-feature-title__text">
                    聯絡資訊
                </h3>
            </header>

            <div class="row justify-content-center my-5">
                <div class="col-lg-5 d-flex align-items-center order-2 order-lg-0">
                    <div class="c-img-deco">
                        <div class="c-img-deco__inner">
                            <img class="img-fluid rounded-4"
                                src="assets/images/contact/contact-info.jpg" alt="vision" loading="lazy">
                        </div>
                    </div>
                </div>

                <div class="col-lg-4 d-flex flex-column gap-4 justify-content-center pb-4">
                    <div class="card h-std-card h-shadow-light">
                        <div class="card-body text-primary d-flex gap-3 align-items-center" style="padding: 2rem">
                            <svg width="60" height="48" viewBox="0 0 60 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M17.5 39C15.3906 39 13.75 37.3594 13.75 35.25V7.75C13.75 5.71875 15.3906 4 17.5 4H22.5C24.5312 4 26.25 5.71875 26.25 7.75V35.25C26.25 37.3594 24.5312 39 22.5 39H17.5ZM15 7.75V35.25C15 36.6562 16.0938 37.75 17.5 37.75H22.5C23.8281 37.75 25 36.6562 25 35.25V7.75C25 6.42188 23.8281 5.25 22.5 5.25H17.5C16.0938 5.25 15 6.42188 15 7.75ZM31.25 37.125V34.625C31.25 33.6094 32.0312 32.75 33.125 32.75H35.625C36.6406 32.75 37.5 33.6094 37.5 34.625V37.125C37.5 38.2188 36.6406 39 35.625 39H33.125C32.0312 39 31.25 38.2188 31.25 37.125ZM32.5 34.625V37.125C32.5 37.5156 32.7344 37.75 33.125 37.75H35.625C35.9375 37.75 36.25 37.5156 36.25 37.125V34.625C36.25 34.3125 35.9375 34 35.625 34H33.125C32.7344 34 32.5 34.3125 32.5 34.625ZM31.25 28.375V25.875C31.25 24.8594 32.0312 24 33.125 24H35.625C36.6406 24 37.5 24.8594 37.5 25.875V28.375C37.5 29.4688 36.6406 30.25 35.625 30.25H33.125C32.0312 30.25 31.25 29.4688 31.25 28.375ZM32.5 25.875V28.375C32.5 28.7656 32.7344 29 33.125 29H35.625C35.9375 29 36.25 28.7656 36.25 28.375V25.875C36.25 25.5625 35.9375 25.25 35.625 25.25H33.125C32.7344 25.25 32.5 25.5625 32.5 25.875ZM44.375 32.75C45.3906 32.75 46.25 33.6094 46.25 34.625V37.125C46.25 38.2188 45.3906 39 44.375 39H41.875C40.7812 39 40 38.2188 40 37.125V34.625C40 33.6094 40.7812 32.75 41.875 32.75H44.375ZM45 37.125V34.625C45 34.3125 44.6875 34 44.375 34H41.875C41.4844 34 41.25 34.3125 41.25 34.625V37.125C41.25 37.5156 41.4844 37.75 41.875 37.75H44.375C44.6875 37.75 45 37.5156 45 37.125ZM46.25 25.875V28.375C46.25 29.4688 45.3906 30.25 44.375 30.25H41.875C40.7812 30.25 40 29.4688 40 28.375V25.875C40 24.8594 40.7812 24 41.875 24H44.375C45.3906 24 46.25 24.8594 46.25 25.875ZM45 28.375V25.875C45 25.5625 44.6875 25.25 44.375 25.25H41.875C41.4844 25.25 41.25 25.5625 41.25 25.875V28.375C41.25 28.7656 41.4844 29 41.875 29H44.375C44.6875 29 45 28.7656 45 28.375ZM46.25 13.375V18.375C46.25 19.4688 45.3906 20.25 44.375 20.25H33.125C32.0312 20.25 31.25 19.4688 31.25 18.375V13.375C31.25 12.3594 32.0312 11.5 33.125 11.5H44.375C45.3906 11.5 46.25 12.3594 46.25 13.375ZM45 18.375V13.375C45 13.0625 44.6875 12.75 44.375 12.75H33.125C32.7344 12.75 32.5 13.0625 32.5 13.375V18.375C32.5 18.7656 32.7344 19 33.125 19H44.375C44.6875 19 45 18.7656 45 18.375ZM48.75 6.5C50.7812 6.5 52.5 8.21875 52.5 10.25V40.25C52.5 42.3594 50.7812 44 48.75 44H11.25C9.14062 44 7.5 42.3594 7.5 40.25V10.25C7.5 8.45312 8.75 6.96875 10.4688 6.57812C10.8594 6.5 11.25 6.8125 11.25 7.20312C11.25 7.51562 11.0156 7.75 10.7031 7.82812C9.53125 8.0625 8.75 9.07812 8.75 10.25V40.25C8.75 41.6562 9.84375 42.75 11.25 42.75H48.75C50.0781 42.75 51.25 41.6562 51.25 40.25V10.25C51.25 8.92188 50.0781 7.75 48.75 7.75H29.375C28.9844 7.75 28.75 7.51562 28.75 7.125C28.75 6.8125 28.9844 6.5 29.375 6.5H48.75Z" fill="#355B81"/>
                            </svg>
                            <a href="tel://02-7751-5999" class="fs-5 stretched-link">(02)7751-5999</a>
                        </div>
                    </div>
                    <div class="card h-std-card h-shadow-light">
                        <div class="card-body text-primary d-flex gap-3 align-items-center" style="padding: 2rem">
                            <svg width="60" height="48" viewBox="0 0 60 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M23.75 16.5C23.75 15.875 24.2969 15.25 25 15.25C25.625 15.25 26.25 15.875 26.25 16.5C26.25 17.2031 25.625 17.75 25 17.75C24.2969 17.75 23.75 17.2031 23.75 16.5ZM36.25 16.5C36.25 17.2031 35.625 17.75 35 17.75C34.2969 17.75 33.75 17.2031 33.75 16.5C33.75 15.875 34.2969 15.25 35 15.25C35.625 15.25 36.25 15.875 36.25 16.5ZM30 27.75C33.6719 27.75 36.1719 25.4062 36.9531 24.3125C37.1094 24 37.5 23.9219 37.8125 24.1562C38.125 24.3125 38.2031 24.7031 37.9688 25.0156C37.0312 26.3438 34.2188 29 30 29C25.7031 29 22.8906 26.3438 21.9531 25.0156C21.7188 24.7031 21.7969 24.3125 22.1094 24.1562C22.4219 23.9219 22.8125 24 22.9688 24.3125C23.75 25.4062 26.25 27.75 30 27.75ZM45 19C45 25.875 35.8594 37.9844 31.7969 43.0625C30.8594 44.2344 29.0625 44.2344 28.125 43.0625C24.0625 37.9844 15 25.875 15 19C15 10.7188 21.6406 4 30 4C38.2812 4 45 10.7188 45 19ZM30 5.25C22.3438 5.25 16.25 11.4219 16.25 19C16.25 20.4844 16.7188 22.3594 17.5781 24.4688C18.5156 26.5781 19.6875 28.8438 21.0938 31.0312C23.8281 35.4844 27.1094 39.7812 29.0625 42.2812C29.5312 42.8281 30.3906 42.8281 30.8594 42.2812C32.8125 39.7812 36.0938 35.4844 38.8281 31.0312C40.2344 28.8438 41.4062 26.5781 42.3438 24.4688C43.2031 22.3594 43.75 20.4844 43.75 19C43.75 11.4219 37.5781 5.25 30 5.25Z" fill="#355B81"/>
                            </svg>

                            <a href="https://goo.gl/maps/7MAhBxX8MxT9ECw46" target="_blank" class="stretched-link fs-5">新北市新莊區中正路715號</a>
                        </div>

                    </div>
                    <div class="card h-std-card h-shadow-light">
                        <div class="card-body text-primary d-flex gap-3 align-items-center" style="padding: 2rem">
                            <svg width="60" height="48" viewBox="0 0 60 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M39.2969 26.5V27.5H40.1562L40.2855 26.6504L39.2969 26.5ZM33.4375 26.5V25.5H32.4375V26.5H33.4375ZM33.4375 44V45H34.4375V44H33.4375ZM25.625 44H24.625V45H25.625V44ZM25.625 26.5H26.625V25.5H25.625V26.5ZM19.2188 26.5H18.2188V27.5H19.2188V26.5ZM19.2188 19.3125V18.3125H18.2188V19.3125H19.2188ZM25.625 19.3125V20.3125H26.625V19.3125H25.625ZM40.7031 4.54688H41.7031V3.71833L40.889 3.5643L40.7031 4.54688ZM40.7031 10.7188V11.7188H41.7031V10.7188H40.7031ZM33.4375 19.3125H32.4375V20.3125H33.4375V19.3125ZM40.3906 19.3125L41.3792 19.4629L41.5543 18.3125H40.3906V19.3125ZM39.2969 25.5H33.4375V27.5H39.2969V25.5ZM32.4375 26.5V44H34.4375V26.5H32.4375ZM33.4375 43H25.625V45H33.4375V43ZM26.625 44V26.5H24.625V44H26.625ZM25.625 25.5H19.2188V27.5H25.625V25.5ZM20.2188 26.5V19.3125H18.2188V26.5H20.2188ZM19.2188 20.3125H25.625V18.3125H19.2188V20.3125ZM26.625 19.3125V13.7656H24.625V19.3125H26.625ZM26.625 13.7656C26.625 10.8419 27.4981 8.67651 28.9221 7.24408C30.3465 5.81123 32.4331 5 35.0781 5V3C32.02 3 29.3801 3.94658 27.5037 5.83404C25.6269 7.72192 24.625 10.4394 24.625 13.7656H26.625ZM35.0781 5C36.3859 5 37.7455 5.13132 38.7886 5.26529C39.3077 5.33196 39.743 5.39858 40.0475 5.44833C40.1996 5.47319 40.3188 5.4938 40.3991 5.50803C40.4392 5.51515 40.4697 5.52067 40.4896 5.52433C40.4996 5.52616 40.5069 5.52752 40.5116 5.52838C40.5139 5.52882 40.5155 5.52912 40.5165 5.5293C40.5169 5.52939 40.5172 5.52945 40.5174 5.52947C40.5174 5.52948 40.5175 5.52949 40.5174 5.52948C40.5174 5.52948 40.5174 5.52947 40.5174 5.52947C40.5173 5.52946 40.5172 5.52945 40.7031 4.54688C40.889 3.5643 40.8889 3.56429 40.8888 3.56427C40.8888 3.56426 40.8887 3.56424 40.8886 3.56422C40.8884 3.56418 40.8881 3.56413 40.8878 3.56408C40.8872 3.56397 40.8865 3.56383 40.8856 3.56366C40.8837 3.56331 40.8812 3.56283 40.8779 3.56223C40.8715 3.56102 40.8623 3.55932 40.8504 3.55714C40.8267 3.55279 40.7923 3.54656 40.7481 3.53872C40.6596 3.52305 40.5316 3.50093 40.37 3.47452C40.047 3.42173 39.5888 3.35163 39.0434 3.28159C37.9576 3.14212 36.5048 3 35.0781 3V5ZM39.7031 4.54688V10.7188H41.7031V4.54688H39.7031ZM40.7031 9.71875H37.5V11.7188H40.7031V9.71875ZM37.5 9.71875C35.7309 9.71875 34.4041 10.2574 33.5405 11.256C32.7005 12.2272 32.4375 13.4754 32.4375 14.625H34.4375C34.4375 13.7433 34.6432 13.0384 35.0532 12.5643C35.4396 12.1176 36.1441 11.7188 37.5 11.7188V9.71875ZM32.4375 14.625V19.3125H34.4375V14.625H32.4375ZM33.4375 20.3125H40.3906V18.3125H33.4375V20.3125ZM39.402 19.1621L38.3083 26.3496L40.2855 26.6504L41.3792 19.4629L39.402 19.1621Z" fill="#355B81"/>
                            </svg>

                            <a href="https://www.facebook.com/ArendellePreschool/" target="_blank" class="stretched-link fs-5">新北市私立艾倫戴爾幼兒園</a>
                        </div>

                    </div>
                </div>
            </div>
        </div>
    </section>

    <section class="l-section l-section--location l-section--decorated text-bg-primary"
        style="
            --deco-img-top: url(../images/contact/location-deco-top.svg);
            --deco-padding-top: 17.5%;
            --deco-img-bottom: url(../images/contact/location-deco-bottom.svg);
            --deco-padding-bottom: 17.5%;
            ">
        <header class="c-feature-title">
            <div class="c-feature-title__top" style="color: var(--bs-golden-tint)">
                Transportation
            </div>

            <h3 class="c-feature-title__text" style="color: var(--bs-golden-tint)">
                交通方式
            </h3>
        </header>

        <div class="container mt-5 mb-6">
            <div class="row justify-content-center">
                <div class="col-lg-10">

                    <div class="card h-std-card">
                        <div class="card-body" style="padding: 2rem;">
                            <div class="row gy-4 align-items-center">
                                <div class="col-lg-7">
                                    <div class="rounded-3 overflow-hidden ratio" style="--bs-aspect-ratio: 66%">
                                        <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3615.1367724603015!2d121.4224551112187!3d25.02943207772684!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3442a74de1790b7f%3A0xa63fdbdb9431a1cf!2z5paw5YyX5biC56eB56uL6Im-5YCr5oi054i-5bm85YWS5ZyS!5e0!3m2!1szh-TW!2stw!4v1685547266192!5m2!1szh-TW!2stw"
                                            width="100%" height="100%" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
                                    </div>
                                </div>
                                <div class="col-lg-5 text-dark text-feature">
                                    <p>
                                        艾倫戴爾幼兒園位於<span
                                            style="color: var(--bs-golden)">新北市新莊區中正路715號</span>，交通便利。
                                        <br />
                                        距離捷運丹鳳站2號出口僅需步行3分鐘，方便家長接送孩子。
                                    </p>
                                    <p class="fs-6 mb-0">
                                        Arendelle Preschool is conveniently located at No. 715 Zhongzheng Road, Xinzhuang District,
                                        New Taipei City. We are just a 3-minute walk from Exit 2 of the Danfeng MRT Station,
                                        making it easy for parents to drop off and pick up their children.
                                    </p>
                                </div>
                            </div>
                        </div>
                    </div>

                </div>
            </div>
        </div>
    </section>


    <section id="contact"
        class="l-section l-section--contact overflow-hidden"
        style="padding-top: 50px; padding-bottom: 140px">
        <header class="c-feature-title">
            <div class="c-feature-title__top">
                Contact Us
            </div>

            <h3 class="c-feature-title__text">
                聯繫我們
            </h3>
        </header>

        <div class="container mt-4">
            <div class="row justify-content-center">
                <div class="col-lg-8">
                    @include('components.contact-form')
                </div>
            </div>
        </div>
    </section>
@stop
